[Killed] BlockStatement
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sumAllOddFibonacciNumbers/sumAllOddFibonacciNumbers.js:1:23
-function sumFibs(num) {
-  validateNum(num);
-
-  const fibSequence = generateFibSequence(num);
-  const fibSequenceWithOnlyOddNumber = filterOddNumber(fibSequence);
-  const sumOfOddNumber = addNumbersFromArray(fibSequenceWithOnlyOddNumber);
-  return sumOfOddNumber;
-}
+function sumFibs(num) {}
 
 function validateNum(num) {
killedBy: Sum All Odd Fibonacci Numbers sumFibs() should throw an error.
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "You must provide a number."

Received function did not throw

[Killed] BlockStatement
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sumAllOddFibonacciNumbers/sumAllOddFibonacciNumbers.js:10:27
   return sumOfOddNumber;
 }
 
-function validateNum(num) {
-  if (num < 1) {
-    throw new Error("You must provide a number greater than 0.");
-  }
-  if (typeof num !== "number") {
-    throw new Error("You must provide a number.");
-  }
-}
+function validateNum(num) {}
 function generateFibSequence(num) {
   const fibSequence = [1, 1];
killedBy: Sum All Odd Fibonacci Numbers sumFibs() should throw an error.
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "You must provide a number."

Received function did not throw

[Killed] EqualityOperator
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sumAllOddFibonacciNumbers/sumAllOddFibonacciNumbers.js:11:7
 }
 
 function validateNum(num) {
-  if (num < 1) {
+  if (num <= 1) {
     throw new Error("You must provide a number greater than 0.");
   }
killedBy: Sum All Odd Fibonacci Numbers sumFibs(1) should return a number.
statusReason: Error: You must provide a number greater than 0.

[Killed] BlockStatement
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sumAllOddFibonacciNumbers/sumAllOddFibonacciNumbers.js:11:16
 }
 
 function validateNum(num) {
-  if (num < 1) {
-    throw new Error("You must provide a number greater than 0.");
-  }
+  if (num < 1) {}
   if (typeof num !== "number") {
     throw new Error("You must provide a number.");
killedBy: Sum All Odd Fibonacci Numbers sumFibs(-1) should throw an error.
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "You must provide a number greater than 0."

Received function did not throw

[Killed] BlockStatement
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sumAllOddFibonacciNumbers/sumAllOddFibonacciNumbers.js:14:32
   if (num < 1) {
     throw new Error("You must provide a number greater than 0.");
   }
-  if (typeof num !== "number") {
-    throw new Error("You must provide a number.");
-  }
+  if (typeof num !== "number") {}
 }
 function generateFibSequence(num) {
killedBy: Sum All Odd Fibonacci Numbers sumFibs() should throw an error.
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "You must provide a number."

Received function did not throw

[Killed] ConditionalExpression
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sumAllOddFibonacciNumbers/sumAllOddFibonacciNumbers.js:14:7
   if (num < 1) {
     throw new Error("You must provide a number greater than 0.");
   }
-  if (typeof num !== "number") {
+  if (false) {
     throw new Error("You must provide a number.");
   }
killedBy: Sum All Odd Fibonacci Numbers sumFibs() should throw an error.
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "You must provide a number."

Received function did not throw

[Killed] BlockStatement
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sumAllOddFibonacciNumbers/sumAllOddFibonacciNumbers.js:18:35
     throw new Error("You must provide a number.");
   }
 }
-function generateFibSequence(num) {
-  const fibSequence = [1, 1];
-  let nextFib = 0;
-  while ((nextFib = fibSequence[0] + fibSequence[1]) <= num) {
-    fibSequence.unshift(nextFib);
-  }
-  return fibSequence;
-}
+function generateFibSequence(num) {}
 
 function filterOddNumber(array) {
killedBy: Sum All Odd Fibonacci Numbers sumFibs(1) should return a number.
statusReason: TypeError: Cannot read property 'filter' of undefined

[Killed] ArrayDeclaration
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sumAllOddFibonacciNumbers/sumAllOddFibonacciNumbers.js:19:23
   }
 }
 function generateFibSequence(num) {
-  const fibSequence = [1, 1];
+  const fibSequence = [];
   let nextFib = 0;
   while ((nextFib = fibSequence[0] + fibSequence[1]) <= num) {
killedBy: Sum All Odd Fibonacci Numbers sumFibs(1) should return a number.
statusReason: TypeError: Reduce of empty array with no initial value

[Killed] ConditionalExpression
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sumAllOddFibonacciNumbers/sumAllOddFibonacciNumbers.js:21:10
 function generateFibSequence(num) {
   const fibSequence = [1, 1];
   let nextFib = 0;
-  while ((nextFib = fibSequence[0] + fibSequence[1]) <= num) {
+  while (false) {
     fibSequence.unshift(nextFib);
   }
killedBy: Sum All Odd Fibonacci Numbers sumFibs(3) should 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 2

[Killed] EqualityOperator
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sumAllOddFibonacciNumbers/sumAllOddFibonacciNumbers.js:21:10
 function generateFibSequence(num) {
   const fibSequence = [1, 1];
   let nextFib = 0;
-  while ((nextFib = fibSequence[0] + fibSequence[1]) <= num) {
+  while ((nextFib = fibSequence[0] + fibSequence[1]) < num) {
     fibSequence.unshift(nextFib);
   }
killedBy: Sum All Odd Fibonacci Numbers sumFibs(3) should 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 2

[Killed] BlockStatement
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sumAllOddFibonacciNumbers/sumAllOddFibonacciNumbers.js:27:33
   return fibSequence;
 }
 
-function filterOddNumber(array) {
-  return array.filter((item) => item % 2 !== 0);
-}
+function filterOddNumber(array) {}
 
 function addNumbersFromArray(array) {
killedBy: Sum All Odd Fibonacci Numbers sumFibs(1) should return a number.
statusReason: TypeError: Cannot read property 'reduce' of undefined

[Killed] ArrowFunction
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sumAllOddFibonacciNumbers/sumAllOddFibonacciNumbers.js:28:23
 }
 
 function filterOddNumber(array) {
-  return array.filter((item) => item % 2 !== 0);
+  return array.filter(() => undefined);
 }
 
killedBy: Sum All Odd Fibonacci Numbers sumFibs(1) should return a number.
statusReason: TypeError: Reduce of empty array with no initial value

[Killed] ConditionalExpression
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sumAllOddFibonacciNumbers/sumAllOddFibonacciNumbers.js:28:33
 }
 
 function filterOddNumber(array) {
-  return array.filter((item) => item % 2 !== 0);
+  return array.filter((item) => true);
 }
 
killedBy: Sum All Odd Fibonacci Numbers sumFibs(2) should return 2.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Killed] BlockStatement
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sumAllOddFibonacciNumbers/sumAllOddFibonacciNumbers.js:31:37
   return array.filter((item) => item % 2 !== 0);
 }
 
-function addNumbersFromArray(array) {
-  return array.reduce(
-    (accumulator, currentValue) => accumulator + currentValue
-  );
-}
+function addNumbersFromArray(array) {}
 
 module.exports = {
killedBy: Sum All Odd Fibonacci Numbers sumFibs(1) should return a number.
statusReason: Error: expect(received).toBeNumber()

Expected value to be a number received:
  undefined
